describe("MovieCollection", function(){

	var movieCollectionFixture = [
		{
	    "id": "this-is-the-end",
	    "image": "this-is-the-end.jpg",
	    "title_en": "This Is the End",
	    "title_ru": "Конец света 2013: Апокалипсис по-голливудски",
	    "description": "Джей Барушель приезжает в Лос-Анджелес, чтобы посетить старого друга и коллегу, актера Сета Рогена, который пригласил Барушеля на новоселье, которое организовывает Джеймс Франко. На не очень приличную вечеринку приехали многие знаменитости. Барушелю неудобно среди такого количества людей, он практически не знает лично таких знаменитостей, как: Джона Хилл, Кристофер Минц-Плассе, Майкл Сера, Крейг Робинсон, Эмма Уотсон и Ченнинг Татум. Роген, чтобы немного успокоить друга, сопровождает его в магазин за сигаретами.\r\nВ магазине лучи синего света с неба вдруг унесли несколько покупателей. Перепуганные Роген и Барушель бегут в дом Франко на фоне взрывов, автомобильных аварий, а также массового хаоса, но на вечеринке синие лучи никого не тронули. Подвыпившие гости не верят россказням Барушеля и объявляют его сумасшедшим, но через несколько секунд слышат снаружи грохот…",
	    "genres": [
	      "комедия",
	      "фэнтези"
	    ],
	    "year": [
	      "2013"
	    ],
	    "countries": [
	      "США"
	    ],
	    "director": [
	      "Сет Роген",
	      "Ивэн Голдберг"
	    ],
	    "actors": [
	      "Сет Роген",
	      "Джей Барушель",
	      "Джеймс Франко",
	      "Джона Хилл",
	      "Крэйг Робинсон",
	      "Дэнни МакБрайд",
	      "Майкл Сера",
	      "Эмма Уотсон",
	      "Ченнинг Татум",
	      "Кристофер МинцПлассе"
	    ],
	    "_id": "52e5373b29d166732296b7f2"
	  },
	  {
	    "id": "carrie",
	    "image": "carrie.jpg",
	    "title_en": "Carrie",
	    "title_ru": "Телекинез",
	    "description": "Застенчивая Кэрри Уайт живет вместе с матерью — набожной пуританкой Маргарет. Девушка страдает от издевательств одноклассников и от воспитания строгой матери. Постепенно она открывает в себе способности к телекинезу. Одноклассники готовят на выпускной грандиозную шутку над Кэрри, но не представляют, чем она обернется.",
	    "genres": [
	      "ужасы",
	      "драма"
	    ],
	    "year": [
	      "2013"
	    ],
	    "countries": [
	      "США"
	    ],
	    "director": [
	      "Кимберли Пирс"
	    ],
	    "actors": [
	      "Хлоя Грейс Морец",
	      "Джулианна Мур",
	      "Джуди Грир",
	      "Габриэлла Уайлд",
	      "Мишель Нолден",
	      "Портия Даблдэй",
	      "Алекс Расселл",
	      "Коннор Прайс",
	      "Зои Белкин",
	      "Синтия Престон"
	    ],
	    "_id": "52e5373b29d166732296b7f3"
	  },
	  {
	    "id": "jackass-presents-bad-grandpa",
	    "image": "jackass-presents-bad-grandpa.jpg",
	    "title_en": "Jackass Presents: Bad Grandpa",
	    "title_ru": "Несносный дед",
	    "description": "86-летний старикан по имени Ирвинг Зисман путешествует по Америке с необычным компаньоном — восьмилетним «внуком» Билли.\r\nПо дороге заводной дедушка знакомит впечатлительного Билли с людьми, местами и ситуациями, которые вряд ли укладываются в рамки привычных представлений о воспитании. Парочка столкнется со стриптизерами, разъяренными участниками помпезного детского конкурса красоты и их не менее злыми мамашами, скорбящими посетителями панихиды, завсегдатаями бара для байкеров и другими ничего не подозревающими гражданами США.",
	    "genres": [
	      "комедия"
	    ],
	    "year": [
	      "2013"
	    ],
	    "countries": [
	      "США"
	    ],
	    "director": [
	      "Джефф Треймейн"
	    ],
	    "actors": [
	      "Джонни Ноксвил",
	      "Джексон Николл",
	      "Грег Харрис",
	      "Джорджина Кэйтс",
	      "Камбер Хейлик",
	      "Джилл Килл",
	      "Мэдисон Дэвис",
	      "Джордж Фонан",
	      "Грэси Мерседес",
	      "Мэрилинн Эллейн"
	    ],
	    "_id": "52e5373b29d166732296b7f4"
	  },
	  {
	    "id": "about-time",
	    "image": "about-time.jpg",
	    "title_en": "About Time",
	    "title_ru": "Бойфренд из будущего",
	    "description": "В возрасте 21 года Тим Лейк обнаруживает, что он может путешествовать во времени. В ночь после очередного неприятного Нового года отец Тима рассказывает ему, что мужчины в его семье всегда имели способность путешествовать во времени. Тим не может изменить историю, но он может изменить то, что происходит или происходило в его собственной жизни.",
	    "genres": [
	      "мелодрама",
	      "комедия",
	      "фантастика"
	    ],
	    "year": [
	      "2013"
	    ],
	    "countries": [
	      "Великобритания"
	    ],
	    "director": [
	      "Ричард Кртис"
	    ],
	    "actors": [
	      "Рэйчел МакАдамс",
	      "Билл Найи",
	      "Донал Глисон",
	      "Том Холландер",
	      "Марго Робби",
	      "Линдсэй Дункан",
	      "Роуэна Даймонд",
	      "Ванесса Кирби Ли",
	      "Николас Харрис",
	      "Нив Гачев"
	    ],
	    "_id": "52e5373b29d166732296b7f5"
	  },
	  {
	    "id": "rush",
	    "image": "rush.jpg",
	    "title_en": "Rush",
	    "title_ru": "Гонка",
	    "description": "Рассказ о противостоянии двух непримиримых соперников из мира «Формулы-1», Ники Лауда и Джеймса Ханта. В 1976 году их схватка на Гран-При Германии едва не привела к гибели Лауды, попавшего в аварию, лишь по провидению судьбы не унесшую его жизнь.",
	    "genres": [
	      "боевик",
	      "драма",
	      "биография"
	    ],
	    "year": [
	      "2013"
	    ],
	    "countries": [
	      "США",
	      "Германия",
	      "Великобритания"
	    ],
	    "director": [
	      "Рон Ховард"
	    ],
	    "actors": [
	      "Крис Хемсворт",
	      "Оливия Уайлд",
	      "Натали Дормер",
	      "Ли АсквитКоу",
	      "Том Влашиха",
	      "Даниэль Брюль",
	      "Жозефин Де Ла Буме",
	      "Александра Мария Лара",
	      "Джулиан Сигер",
	      "Джейми Сивес"
	    ],
	    "_id": "52e5373b29d166732296b7f6"
	  },
	  {
	    "id": "47-ronin",
	    "image": "47-ronin.jpg",
	    "title_en": "47 Ronin",
	    "title_ru": "47 ронинов",
	    "description": "Таинственный странник, преданный всеми, проданный в рабство, избранный судьбой вершить месть, станет одним из 47 воинов, бросивших вызов смерти. Явившись из другого мира, он восстанет против темных сил, чтобы защитить свою запретную любовь.",
	    "genres": [
	      "боевик",
	      "драма",
	      "фэнтези"
	    ],
	    "year": [
	      "2013"
	    ],
	    "countries": [
	      "США"
	    ],
	    "director": [
	      "Карл Ринш"
	    ],
	    "actors": [
	      "Киану Ривз",
	      "Хироюки Санада",
	      "Ко Шибасаки",
	      "Таданобу Асано",
	      "Ринко Кикучи",
	      "Джин Аканиши",
	      "Йорик ван Вагенинген",
	      "КэриХироюки Тагава",
	      "Того Игава",
	      "Харука Абе"
	    ],
	    "_id": "52e5373b29d166732296b7f7"
	  },
	  {
	    "id": "push",
	    "image": "push.jpg",
	    "title_en": "Push",
	    "title_ru": "Пятое измерение",
	    "description": "Ник, американский эмигрант, обладает способностью к телекинезу. Он скрывается в Гонконге от могущественной организации, которая хочет эксплуатировать его дар в своих целях. Вскоре молодой человек встречает свою бывшую возлюбленную и знакомится с девочкой Кэсси, способной предсказывать будущее. Она видит, что только вместе они смогут выжить и нарушить планы зловещей корпорации…",
	    "genres": [
	      "фантастика",
	      "боевик",
	      "триллер"
	    ],
	    "year": [
	      "2009"
	    ],
	    "countries": [
	      "США"
	    ],
	    "director": [
	      "Пол МакГиган"
	    ],
	    "actors": [
	      "Крис Эванс",
	      "Колин Форд",
	      "Джоэль Гретш",
	      "Джимон Хонсу",
	      "Дакота Фаннинг",
	      "Роберт Тсонос",
	      "Брэндон Перлман",
	      "Камилла Белль",
	      "Нил Джексон"
	    ],
	    "_id": "52e5373b29d166732296b7f8"
	  }
	];

	var singleMovie =   {
	    "id": "push",
	    "image": "push.jpg",
	    "title_en": "Push",
	    "title_ru": "Пятое измерение",
	    "description": "Ник, американский эмигрант, обладает способностью к телекинезу. Он скрывается в Гонконге от могущественной организации, которая хочет эксплуатировать его дар в своих целях. Вскоре молодой человек встречает свою бывшую возлюбленную и знакомится с девочкой Кэсси, способной предсказывать будущее. Она видит, что только вместе они смогут выжить и нарушить планы зловещей корпорации…",
	    "genres": [
	      "фантастика",
	      "боевик",
	      "триллер"
	    ],
	    "year": [
	      "2009"
	    ],
	    "countries": [
	      "США"
	    ],
	    "director": [
	      "Пол МакГиган"
	    ],
	    "actors": [
	      "Крис Эванс",
	      "Колин Форд",
	      "Джоэль Гретш",
	      "Джимон Хонсу",
	      "Дакота Фаннинг",
	      "Роберт Тсонос",
	      "Брэндон Перлман",
	      "Камилла Белль",
	      "Нил Джексон"
	    ],
	    "_id": "52e5373b29d166732296b7f8"
	  };

	it("should expose an attribute", function() {
		var movie = new Backbone.Model(singleMovie);

		expect(movie.get("id")).toEqual("push");
		expect(movie.get("image")).toEqual("push.jpg");
		expect(movie.get("title_en")).toEqual("Push");
		expect(movie.get("title_ru")).toEqual("Пятое измерение");
	});

    it("MovieCollection should be sorted by movie name", function(){
       expect(true).toEqual(true);
    });
});

