var movieFixture = {
	"id": "push",
	"image": "push.jpg",
	"title_en": "Push",
	"title_ru": "Пятое измерение",
	"description": "Ник, американский эмигрант, обладает способностью к телек…",
	"genres": [
		"фантастика",
		"боевик",
		"триллер"
	],
	"year": [
		"2009"
	],
	"countries": [
		"США"
	],
	"director": [
		"Пол МакГиган"
	],
	"actors": [
		"Крис Эванс",
		"Колин Форд",
		"Джоэль Гретш",
		"Джимон Хонсу",
		"Дакота Фаннинг",
		"Роберт Тсонос",
		"Брэндон Перлман",
		"Камилла Белль",
		"Нил Джексон"
	],
	"_id": "52e5373b29d166732296b7f8"
};